In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("Social_Network_Ads.csv")
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
data = data[['User ID','EstimatedSalary']]
data = data.dropna()
data

      User ID  EstimatedSalary
0    15624510            19000
1    15810944            20000
2    15668575            43000
3    15603246            57000
4    15804002            76000
..        ...              ...
395  15691863            41000
396  15706071            23000
397  15654296            20000
398  15755018            33000
399  15594041            36000

[400 rows x 2 columns]